# IS 362 - Final Project: GIS + SQLite

To begin, I will import the pandas module and additional modules.

In [3]:
import pandas as pd
import sqlite3

from pandas import DataFrame
from sqlite3 import Error

Add the SQLite connection statement.

In [4]:
db = sqlite3.connect("data/nyc_gdb_jan2018.sqlite")

Then create the SQL query and execute.

In [7]:
sql = '''PRAGMA  table_info  (a_boroughs)'''
pd.read_sql(sql, db).head()

   cid      name          type  notnull dflt_value  pk
0    0     bcode          TEXT        1       None   1
1    1     bname          TEXT        0       None   0
2    2      name          TEXT        0       None   0
3    3  namelsad          TEXT        0       None   0
4    4  geometry  MULTIPOLYGON        0       None   0

In [8]:
sql = '''SELECT
        *
        FROM a_boroughs'''
pd.read_sql(sql, db).head()

,bcode,bname,name,namelsad,geometry
0,36005,Bronx,Bronx,Bronx County,"[ , , �, ,  ,  , L, �, J, �, l, �, ., A, �, ..."
1,36047,Brooklyn,Kings,Kings County,"[ , , �, ,  ,  , , +, �, �, L, �, -, A, , ..."
2,36061,Manhattan,New York,New York County,"[ , , �, ,  ,  , �, }, c, �, , �, -, A, Q, ..."
3,36081,Queens,Queens,Queens County,"[ , , �, ,  ,  , , �, , �, 3, Z, ., A, Z, ..."
4,36085,Staten Island,Richmond,Richmond County,"[ , , �, ,  ,  , �, �, 7, a, �, �, +, A, $, ..."

In [9]:
sql = '''SELECT  geoid,
         geoid2, 
         geolabel,
         HD01_S001
         AS  pop2010
         FROM  b_zctas_2010census
         ORDER  BY  pop2010 DESC'''
pd.read_sql(sql, db).head()

            GEOID GEOID2     GEOLABEL  pop2010
0  8600000US11368  11368  ZCTA5 11368   109931
1  8600000US11226  11226  ZCTA5 11226   101572
2  8600000US11373  11373  ZCTA5 11373   100820
3  8600000US11220  11220  ZCTA5 11220    99598
4  8600000US11385  11385  ZCTA5 11385    98592

In [10]:
sql = '''SELECT  zcta,
         bcode, 
         HD01_S001
         AS  pop2010
         FROM  a_zctas, b_zctas_2010census
         WHERE  zcta=geoid2  AND  bcode="36061" AND  pop2010 > 200
         ORDER  BY  pop2010'''
pd.read_sql(sql, db).head()

    zcta  bcode  pop2010
0  10162  36061     1685
1  10006  36061     3011
2  10004  36061     3089
3  10282  36061     4783
4  10069  36061     5199

In [12]:
sql = '''SELECT  stop_name,  trains, bcode,  ST_AsText(geometry)  AS  coordinates
FROM  a_subway_stations'''
pd.read_sql(sql, db).head()

DatabaseError: Execution failed on sql 'SELECT  stop_name,  trains, bcode,  ST_AsText(geometry)  AS  coordinates
FROM  a_subway_stations': no such function: ST_AsText